---
kind: method
id: M:Autodesk.Revit.UI.RibbonItem.Equals(System.Object)
source: html/0620140c-8371-aef3-a747-02069218fc57.htm
---
# Autodesk.Revit.UI.RibbonItem.Equals Method

Determines whether the specified Object is equal to the current Object .

## Syntax (C#)
```csharp
public override bool Equals(
	Object obj
)
```

## Parameters
- **obj** (`System.Object`) - Another panel object.